In [1]:
import pandas as pd

In [2]:
ds= pd.read_csv('StudentsPerformance.csv')

In [3]:
ds

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72,74
1,female,NaN,some college,standard,complete,NaN,90,88
2,female,group B,master's degree,standard,none,90.0,95,93
3,male,group A,NaN,free/reduced,none,47.0,57,44
4,male,group C,some college,NaN,none,76.0,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88.0,99,95
996,male,group C,high school,free/reduced,none,62.0,55,55
997,female,group C,high school,free/reduced,completed,59.0,71,65
998,female,group D,some college,standard,completed,68.0,78,77
999,female,group D,some college,free/reduced,none,77.0,86,86

In [4]:
ds.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72,74
1,female,NaN,some college,standard,complete,NaN,90,88
2,female,group B,master's degree,standard,none,90.0,95,93
3,male,group A,NaN,free/reduced,none,47.0,57,44
4,male,group C,some college,NaN,none,76.0,78,75

In [4]:
import numpy as np

In [12]:
ds['race/ethnicity'].isnull()

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: race/ethnicity, Length: 1000, dtype: bool

In [14]:
ds['lunch'].isnull()

0      False
1      False
2      False
3      False
4       True
       ...
995    False
996    False
997    False
998    False
999    False
Name: lunch, Length: 1000, dtype: bool

In [15]:
ds['parental level of education'].isnull()

0      False
1      False
2      False
3       True
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: parental level of education, Length: 1000, dtype: bool

In [16]:
ds['math score'].isnull()

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: math score, Length: 1000, dtype: bool

In [17]:
# Total missing values for each feature
ds.isnull().sum()

gender                          0
race/ethnicity                  1
parental level of education     1
lunch                           1
test preparation course        11
math score                      1
reading score                   0
writing score                   0
dtype: int64

In [19]:
ds['race/ethnicity'].fillna('group A', inplace=True)

In [21]:
ds['parental level of education'].fillna('high school', inplace=True)

In [23]:
ds['lunch'].fillna('standard', inplace=True)

In [24]:
ds['math score'].fillna(98, inplace=True)

In [25]:
ds['test preparation course'].fillna('complete', inplace=True)

In [26]:
ds.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [27]:
ds

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72,74
1,female,group A,some college,standard,complete,98.0,90,88
2,female,group B,master's degree,standard,none,90.0,95,93
3,male,group A,high school,free/reduced,none,47.0,57,44
4,male,group C,some college,standard,none,76.0,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88.0,99,95
996,male,group C,high school,free/reduced,none,62.0,55,55
997,female,group C,high school,free/reduced,completed,59.0,71,65
998,female,group D,some college,standard,completed,68.0,78,77
999,female,group D,some college,free/reduced,none,77.0,86,86

In [30]:
ds.info

<bound method DataFrame.info of      gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1    female        group A                some college      standard
2    female        group B             master's degree      standard
3      male        group A                 high school  free/reduced
4      male        group C                some college      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none        72.0             72             74
1                  complete        98.0             90             88
2                      none        90.0             95             93
3                      none        47.0             57             44
4                      none        76.0             78             75
..                      ...         ...            ...            ...
995               completed        88.0             99             95
996                    none        62.0             55             55
997               completed        59.0             71             65
998               completed        68.0             78             77
999                    none        77.0             86             86

[1000 rows x 8 columns]>

In [31]:
ds.describe()

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     66.118000      69.169000      68.054000
std      15.196348      14.600192      15.195657
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      57.750000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.000000      79.000000
max     100.000000     100.000000     100.000000

In [32]:
Q1 = ds.quantile(0.25)
Q3 = ds.quantile(0.75)
IQR = Q3 - Q1
print(IQR)

math score       20.00
reading score    20.00
writing score    21.25
dtype: float64

In [5]:
from scipy import stats

In [13]:
# Outlier Detection
# Zscore = (data_point -mean) / std. deviation

z = np.abs(stats.zscore(ds['reading score']))
z

0      0.193999
1      1.427476
2      1.770109
3      0.833899
4      0.605158
         ...
995    2.044215
996    0.970952
997    0.125472
998    0.605158
999    1.153370
Name: reading score, Length: 1000, dtype: float64

In [14]:
threshold = 3
 
# Position of the outlier
arr = np.where(z > 3)
print(arr)
print("Total outliers using Z-Score: ", len(arr[0]))

(array([ 59, 327, 596, 980]),)
Total outliers using Z-Score:  4

In [15]:
# IQR 
Q1 = np.percentile(ds['reading score'], 25,
                   interpolation = 'midpoint')
 
Q3 = np.percentile(ds['reading score'], 75,
                   interpolation = 'midpoint')
IQR = Q3 - Q1
IQR

20.0

In [17]:
# Above Upper bound
upper = ds['reading score'] >= (Q3+1.5*IQR)
 
print("Upper bound:",Q3+1.5*IQR)
print(np.where(upper))

Upper bound: 109.0
(array([], dtype=int64),)

In [19]:
# Below Lower bound
lower = ds['reading score'] <= (Q1-1.5*IQR)
print("Lower bound:", Q1-1.5*IQR)
print(np.where(lower))

Lower bound: 29.0
(array([ 59,  76, 211, 327, 596, 601, 896, 980]),)

In [13]:
#Trimming
index = ds[(ds['reading score'] >= 100.000000)|(ds['reading score'] <= 35.000000)].index
ds.drop(index, inplace=True)
ds['reading score'].describe()

count    968.000000
mean      69.255165
std       13.329954
min       37.000000
25%       60.000000
50%       70.000000
75%       79.000000
max       99.000000
Name: reading score, dtype: float64

In [15]:
print(ds['reading score'].quantile(0.10))
print(ds['reading score'].quantile(0.90))

51.0
86.0

In [16]:
#new skewness value
ds["reading score"] = np.where(ds["reading score"] <2960.0, 2960.0,ds['reading score'])
ds["reading score"] = np.where(ds["reading score"] >12681.0, 12681.0,ds['reading score'])
print(ds['reading score'].skew())

0